stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_i3c.h
} I3C_XferTypeDef;
/**
  * @}
  */

/** @defgroup I3C_Autonomous_Mode_Configuration_Structure_definition Autonomous Mode Configuration Structure definition
  * @brief  I3C Autonomous Mode Configuration structure definition
  * @{
  */
typedef struct
{
  uint32_t TriggerState;        /*!< Specifies the trigger state. This parameter can be a value
                                     of @ref I3C_AutonomousMode_FunctionalState */

  uint32_t TriggerSelection;    /*!< Specifies the autonomous mode trigger signal selection. This parameter
                                     can be a value of @ref I3C_AutonomousMode_TriggerSelection */

  uint32_t TriggerPolarity;     /*!< Specifies the autonomous mode trigger signal polarity sensitivity. This parameter
                                     can be a value of @ref I3C_AutonomousMode_TriggerPolarity */
} I3C_AutonomousModeConfTypeDef;
/**
  * @}
  */

/** @defgroup I3C_handle_Structure_definition I3C handle Structure definition
  * @brief    I3C handle Structure definition
  * @{
  */
typedef struct __I3C_HandleTypeDef
{
  I3C_TypeDef                *Instance;                           /*!< I3C registers base address                */

  I3C_InitTypeDef            Init;                                /*!< I3C communication parameters              */

  HAL_I3C_ModeTypeDef        Mode;                                /*!< I3C communication mode.
                                                                       This parameter must be a value of
                                                                       @ref I3C_mode_structure_definition        */

  I3C_XferTypeDef            *pXferData;                          /*!< I3C transfer buffers pointer              */

  const I3C_CCCTypeDef       *pCCCDesc;                           /*!< I3C CCC descriptor pointer                */

  const I3C_PrivateTypeDef   *pPrivateDesc;                       /*!< I3C private transfer descriptor pointer   */

  uint32_t                   ControlXferCount;                    /*!< I3C counter indicating the remaining
                                                                       control data bytes to write in
                                                                       the control register                      */

  uint32_t                   RxXferCount;                         /*!< I3C counter indicating the remaining
                                                                       data bytes to receive                     */

  uint32_t                   TxXferCount;                         /*!< I3C counter indicating the remaining
                                                                       data bytes to transmit                    */

#if defined(HAL_DMA_MODULE_ENABLED)
  DMA_HandleTypeDef          *hdmacr;                             /*!< I3C control DMA handle parameters         */

  DMA_HandleTypeDef          *hdmatx;                             /*!< I3C Tx DMA handle parameters              */

  DMA_HandleTypeDef          *hdmarx;                             /*!< I3C Rx DMA handle parameters              */

  DMA_HandleTypeDef          *hdmasr;                             /*!< I3C status DMA handle parameters          */
#endif /* HAL_DMA_MODULE_ENABLED */

  HAL_LockTypeDef            Lock;                                /*!< I3C locking object                        */

  __IO HAL_I3C_StateTypeDef  State;                               /*!< I3C communication state                   */

  __IO HAL_I3C_StateTypeDef  PreviousState;                       /*!< I3C communication previous state          */

  __IO uint32_t              ErrorCode;                           /*!< I3C Error code                            */

  HAL_StatusTypeDef(*XferISR)(struct __I3C_HandleTypeDef *hi3c,
                              uint32_t itMasks);                  /*!< I3C transfer IRQ handler function pointer */

  void(*ptrTxFunc)(struct __I3C_HandleTypeDef *hi3c);             /*!< I3C transmit function pointer             */

  void(*ptrRxFunc)(struct __I3C_HandleTypeDef *hi3c);             /*!< I3C receive function pointer              */

#if (USE_HAL_I3C_REGISTER_CALLBACKS == 1U)

  void (* CtrlTxCpltCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Controller private data and CCC Tx Transfer complete callback                           */

  void (* CtrlRxCpltCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Controller private data and CCC Rx Transfer completed callback                          */

  void (* CtrlMultipleXferCpltCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Controller multiple Direct CCC, I3C private or I2C Transfer completed callback          */

  void (* CtrlDAACpltCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Controller Dynamic Address Assignment completed callback                                */

  void (* TgtReqDynamicAddrCallback)(struct __I3C_HandleTypeDef *hi3c, uint64_t targetPayload);
  /*!< I3C Controller request dynamic address callback during Dynamic Address Assignment processus */

  void (* TgtTxCpltCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Target private data Tx Transfer completed callback                                      */

  void (* TgtRxCpltCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Target private data Rx Transfer completed callback                                      */

  void (* TgtHotJoinCallback)(struct __I3C_HandleTypeDef *hi3c, uint8_t dynamicAddress);
  /*!< I3C Target Hot-Join callback                                                                */

  void (* NotifyCallback)(struct __I3C_HandleTypeDef *hi3c, uint32_t eventId);
  /*!< I3C Target or Controller asynchronous events callback                                       */

  void (* ErrorCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Error callback                                                                          */

  void (* AbortCpltCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Abort complete callback                                                                 */

  void (* MspInitCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Msp Init callback                                                                       */

  void (* MspDeInitCallback)(struct __I3C_HandleTypeDef *hi3c);
  /*!< I3C Msp DeInit callback                                                                     */

#endif /* USE_HAL_I3C_REGISTER_CALLBACKS == 1U */

