stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_i3c.h
/** @defgroup I3C_STATUS_FIFO_STATE STATUS FIFO STATE
  * @{
  */
#define HAL_I3C_STATUSFIFO_DISABLE  0x00000000U      /*!< Status FIFO mode disable */
#define HAL_I3C_STATUSFIFO_ENABLE   I3C_CFGR_SMODE   /*!< Status FIFO mode enable  */
/**
  * @}
  */

/** @defgroup I3C_DIRECTION DIRECTION
  * @{
  */
#define HAL_I3C_DIRECTION_WRITE     LL_I3C_DIRECTION_WRITE       /*!< Write transfer          */
#define HAL_I3C_DIRECTION_READ      LL_I3C_DIRECTION_READ        /*!< Read transfer           */
#define HAL_I3C_DIRECTION_BOTH      (LL_I3C_DIRECTION_READ | 1U) /*!< Read and Write transfer */
/**
  * @}
  */

/** @defgroup I3C_PAYLOAD_SIZE PAYLOAD SIZE
  * @{
  */
#define HAL_I3C_PAYLOAD_EMPTY    LL_I3C_PAYLOAD_EMPTY   /*!< Empty payload, no additional data after IBI acknowledge */
#define HAL_I3C_PAYLOAD_1_BYTE   LL_I3C_PAYLOAD_1_BYTE  /*!< One additional data byte after IBI acknowledge          */
#define HAL_I3C_PAYLOAD_2_BYTES  LL_I3C_PAYLOAD_2_BYTES /*!< Two additional data bytes after IBI acknowledge         */
#define HAL_I3C_PAYLOAD_3_BYTES  LL_I3C_PAYLOAD_3_BYTES /*!< Three additional data bytes after IBI acknowledge       */
#define HAL_I3C_PAYLOAD_4_BYTES  LL_I3C_PAYLOAD_4_BYTES /*!< Four additional data bytes after IBI acknowledge        */
/**
  * @}
  */

/** @defgroup I3C_HANDOFF_ACTIVITY_STATE HANDOFF ACTIVITY STATE
  * @{
  */
#define HAL_I3C_HANDOFF_ACTIVITY_STATE_0  LL_I3C_HANDOFF_ACTIVITY_STATE_0  /*!< Activity state 0 after handoff */
#define HAL_I3C_HANDOFF_ACTIVITY_STATE_1  LL_I3C_HANDOFF_ACTIVITY_STATE_1  /*!< Activity state 1 after handoff */
#define HAL_I3C_HANDOFF_ACTIVITY_STATE_2  LL_I3C_HANDOFF_ACTIVITY_STATE_2  /*!< Activity state 2 after handoff */
#define HAL_I3C_HANDOFF_ACTIVITY_STATE_3  LL_I3C_HANDOFF_ACTIVITY_STATE_3  /*!< Activity state 3 after handoff */
/**
  * @}
  */

/** @defgroup I3C_GETMXDS_FORMAT GETMXDS FORMAT
  * @{
  */
#define HAL_I3C_GETMXDS_FORMAT_1     LL_I3C_GETMXDS_FORMAT_1      /*!< GETMXDS CCC Format 1 is used, no MaxRdTurn
                                                                       field in response                              */
#define HAL_I3C_GETMXDS_FORMAT_2_LSB LL_I3C_GETMXDS_FORMAT_2_LSB  /*!< GETMXDS CCC Format 2 is used, MaxRdTurn field
                                                                       in response, LSB = RDTURN[7:0]                 */
#define HAL_I3C_GETMXDS_FORMAT_2_MID LL_I3C_GETMXDS_FORMAT_2_MID  /*!< GETMXDS CCC Format 2 is used, MaxRdTurn field
                                                                       in response, Middle byte = RDTURN[7:0]         */
#define HAL_I3C_GETMXDS_FORMAT_2_MSB LL_I3C_GETMXDS_FORMAT_2_MSB  /*!< GETMXDS CCC Format 2 is used, MaxRdTurn field
                                                                       in response, MSB = RDTURN[7:0]                 */
/**
  * @}
  */

/** @defgroup I3C_TURNAROUND_TIME_TSCO TURNAROUND TIME TSCO
  * @{
  */
#define HAL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS    LL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS
/*!< clock-to-data turnaround time tSCO <= 12ns */
#define HAL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS  LL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS
/*!< clock-to-data turnaround time tSCO > 12ns  */
/**
  * @}
  */

/** @defgroup I3C_AutonomousMode_FunctionalState I3C Autonomous Mode Trigger State
  * @{
  */
#define I3C_TRIGGER_DISABLE             (0x00000000U)                    /*!< HW trigger mode is disabled  */
#define I3C_TRIGGER_ENABLE              I3C_CFGR_TRIGHWEN                /*!< HW trigger mode is enabled   */
/**
  * @}
  */

/** @defgroup I3C_AutonomousMode_TriggerSelection I3C Autonomous Mode Trigger Selection
  * @{
  */
#define I3C_TRIG_GRP1                   (0x80000000U)                    /*!< Trigger Group for I3C1, I3C2 */

#define I3C_GRP1_GPDMA_CH0_TCF_TRG      (uint32_t)(I3C_TRIG_GRP1 | (0x00000000U))
/*!< HW Trigger signal is GPDMA_CH0_TRG     */
#define I3C_GRP1_GPDMA_CH1_TCF_TRG      (uint32_t)(I3C_TRIG_GRP1 | (0x1U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is GPDMA_CH1_TRG     */
#define I3C_GRP1_GPDMA_CH2_TCF_TRG      (uint32_t)(I3C_TRIG_GRP1 | (0x2U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is GPDMA_CH2_TRG     */
#define I3C_GRP1_GPDMA_CH3_TCF_TRG      (uint32_t)(I3C_TRIG_GRP1 | (0x3U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is GPDMA_CH3_TRG     */
#define I3C_GRP1_EXTI5_TRG              (uint32_t)(I3C_TRIG_GRP1 | (0x4U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is EXTI5_TRG         */
#define I3C_GRP1_EXTI9_TRG              (uint32_t)(I3C_TRIG_GRP1 | (0x5U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is EXTI9_TRG         */
#define I3C_GRP1_LPTIM1_CH1_TRG         (uint32_t)(I3C_TRIG_GRP1 | (0x6U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is LPTIM1_CH1_TRG    */
#define I3C_GRP1_LPTIM2_CH1_TRG         (uint32_t)(I3C_TRIG_GRP1 | (0x7U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is LPTIM2_CH1_TRG    */
#define I3C_GRP1_COMP1_TRG              (uint32_t)(I3C_TRIG_GRP1 | (0x8U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is COMP1_TRG         */
#define I3C_GRP1_COMP2_TRG              (uint32_t)(I3C_TRIG_GRP1 | (0x9U << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is COMP2_TRG         */
#define I3C_GRP1_RTC_ALRA_TRG           (uint32_t)(I3C_TRIG_GRP1 | (0xAU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is RTC_ALRA_TRG      */
#define I3C_GRP1_RTC_WUT_TRG            (uint32_t)(I3C_TRIG_GRP1 | (0xBU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is RTC_WUT_TRG       */
#define I3C_GRP1_TIM15_TGO_CKTIM_TRG    (uint32_t)(I3C_TRIG_GRP1 | (0xCU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is TIM15_TGO_CKTIM_TRG */
#define I3C_GRP1_TIM16_OC1_TRG          (uint32_t)(I3C_TRIG_GRP1 | (0xDU << I3C_CFGR_TRIGSEL_Pos))
/*!< HW Trigger signal is TIM16_OC1_TRG     */
/**
  * @}
  */

/** @defgroup I3C_AutonomousMode_TriggerPolarity Autonomous Mode Trigger Polarity
  * @{
  */
#define I3C_TRIG_POLARITY_LOW           LL_I3C_TRIG_LOW  /*!< I3C HW Trigger is active when signal is 0 */
#define I3C_TRIG_POLARITY_HIGH          LL_I3C_TRIG_HIGH /*!< I3C HW Trigger is active when signal is 1 */
/**
  * @}
  */

/** @defgroup I3C_EndOfFrameConfig End Of Frame Configuration
  * @{
  */
#define I3C_END_OF_FRAME_CPLT_ENABLE     LL_I3C_END_OF_FRAME_CPLT_ENABLE
/*!< Frame Completion Flag need to be clear by SW action (default configuration) */
#define I3C_END_OF_FRAME_CPLT_DISABLE    LL_I3C_END_OF_FRAME_CPLT_DISABLE
/*!< Frame Completion Flag is autoclear by HW, no need SW action */
/**
  * @}
  */

/** @defgroup I3C_COMMON_INTERRUPT I3C COMMON INTERRUPT
  * @{
  */
#define HAL_I3C_IT_TXFNFIE      LL_I3C_IER_TXFNFIE /*!< Tx FIFO not full interrupt enable      */
#define HAL_I3C_IT_RXFNEIE      LL_I3C_IER_RXFNEIE /*!< Rx FIFO not empty interrupt enable     */
#define HAL_I3C_IT_FCIE         LL_I3C_IER_FCIE    /*!< Frame complete interrupt enable        */
#define HAL_I3C_IT_ERRIE        LL_I3C_IER_ERRIE   /*!< Error interrupt enable                 */
#define HAL_I3C_ALL_COMMON_ITS  (uint32_t)(LL_I3C_IER_TXFNFIE | LL_I3C_IER_RXFNEIE | \
                                           LL_I3C_IER_FCIE    | LL_I3C_IER_ERRIE)
/**
  * @}
  */

/** @defgroup I3C_TARGET_INTERRUPT I3C TARGET INTERRUPT
  * @{
  */
#define HAL_I3C_IT_IBIENDIE     LL_I3C_IER_IBIENDIE /*!< IBI end interrupt enable                    */
#define HAL_I3C_IT_CRUPDIE      LL_I3C_IER_CRUPDIE  /*!< controller-role update interrupt enable     */
#define HAL_I3C_IT_WKPIE        LL_I3C_IER_WKPIE    /*!< wakeup interrupt enable                     */
#define HAL_I3C_IT_GETIE        LL_I3C_IER_GETIE    /*!< GETxxx CCC interrupt enable                 */
#define HAL_I3C_IT_STAIE        LL_I3C_IER_STAIE    /*!< GETSTATUS CCC interrupt enable              */
#define HAL_I3C_IT_DAUPDIE      LL_I3C_IER_DAUPDIE  /*!< ENTDAA/RSTDAA/SETNEWDA CCC interrupt enable */
#define HAL_I3C_IT_MWLUPDIE     LL_I3C_IER_MWLUPDIE /*!< SETMWL CCC interrupt enable                 */
#define HAL_I3C_IT_MRLUPDIE     LL_I3C_IER_MRLUPDIE /*!< SETMRL CCC interrupt enable                 */
#define HAL_I3C_IT_RSTIE        LL_I3C_IER_RSTIE    /*!< reset pattern interrupt enable              */
#define HAL_I3C_IT_ASUPDIE      LL_I3C_IER_ASUPDIE  /*!< ENTASx CCC interrupt enable                 */
#define HAL_I3C_IT_INTUPDIE     LL_I3C_IER_INTUPDIE /*!< ENEC/DISEC CCC interrupt enable             */
#define HAL_I3C_IT_DEFIE        (LL_I3C_IER_DEFIE | LL_I3C_IER_RXFNEIE)
/*!< DEFTGTS CCC interrupt enable                */
#define HAL_I3C_IT_GRPIE        (LL_I3C_IER_GRPIE | LL_I3C_IER_RXFNEIE)
/*!< DEFGRPA CCC interrupt enable                */
#define HAL_I3C_ALL_TGT_ITS     (uint32_t)(LL_I3C_IER_IBIENDIE | LL_I3C_IER_CRUPDIE  | LL_I3C_IER_WKPIE   | \
                                           LL_I3C_IER_GETIE    | LL_I3C_IER_STAIE    | LL_I3C_IER_DAUPDIE | \
                                           LL_I3C_IER_MWLUPDIE | LL_I3C_IER_MRLUPDIE | LL_I3C_IER_RSTIE   | \
                                           LL_I3C_IER_ASUPDIE  | LL_I3C_IER_INTUPDIE | LL_I3C_IER_DEFIE   | \
                                           LL_I3C_IER_GRPIE)
/**
  * @}
  */

/** @defgroup I3C_CONTROLLER_INTERRUPT I3C CONTROLLER INTERRUPT
  * @{
  */
#define HAL_I3C_IT_CFNFIE      LL_I3C_IER_CFNFIE     /*!< Control FIFO not full interrupt enable     */
#define HAL_I3C_IT_SFNEIE      LL_I3C_IER_SFNEIE     /*!< Status FIFO not empty interrupt enable     */
#define HAL_I3C_IT_HJIE        LL_I3C_IER_HJIE       /*!< Hot-join interrupt enable                  */
#define HAL_I3C_IT_CRIE        LL_I3C_IER_CRIE       /*!< Controller-role request interrupt enable   */
#define HAL_I3C_IT_IBIIE       LL_I3C_IER_IBIIE      /*!< IBI request interrupt enable               */
#define HAL_I3C_IT_RXTGTENDIE  LL_I3C_IER_RXTGTENDIE /*!< Target-initiated read end interrupt enable */
#define HAL_I3C_ALL_CTRL_ITS   (uint32_t)(LL_I3C_IER_CFNFIE | LL_I3C_IER_SFNEIE | LL_I3C_IER_HJIE | \
                                          LL_I3C_IER_CRIE  | LL_I3C_IER_IBIIE  | LL_I3C_IER_RXTGTENDIE)
/**
  * @}
  */

/** @defgroup I3C_FLAGS I3C FLAGS
  * @{
  */
#define HAL_I3C_FLAG_CFEF       LL_I3C_EVR_CFEF      /*!< Control FIFO not empty flag      */
#define HAL_I3C_FLAG_TXFEF      LL_I3C_EVR_TXFEF     /*!< Tx FIFO empty flag               */
#define HAL_I3C_FLAG_CFNFF      LL_I3C_EVR_CFNFF     /*!< Control FIFO not full flag       */
#define HAL_I3C_FLAG_SFNEF      LL_I3C_EVR_SFNEF     /*!< Status FIFO not empty flag       */
#define HAL_I3C_FLAG_TXFNFF     LL_I3C_EVR_TXFNFF    /*!< Tx FIFO not full flag            */
#define HAL_I3C_FLAG_RXFNEF     LL_I3C_EVR_RXFNEF    /*!< Rx FIFO not empty flag           */
#define HAL_I3C_FLAG_RXLASTF    LL_I3C_EVR_RXLASTF   /*!< Last read data byte/word flag    */
#define HAL_I3C_FLAG_TXLASTF    LL_I3C_EVR_TXLASTF   /*!< Last written data byte/word flag */
#define HAL_I3C_FLAG_FCF        LL_I3C_EVR_FCF       /*!< Frame complete flag              */
#define HAL_I3C_FLAG_RXTGTENDF  LL_I3C_EVR_RXTGTENDF /*!< Target-initiated read end flag   */
#define HAL_I3C_FLAG_ERRF       LL_I3C_EVR_ERRF      /*!< Error flag                       */
#define HAL_I3C_FLAG_IBIF       LL_I3C_EVR_IBIF      /*!< IBI request flag                 */
#define HAL_I3C_FLAG_IBIENDF    LL_I3C_EVR_IBIENDF   /*!< IBI end flag                     */
#define HAL_I3C_FLAG_CRF        LL_I3C_EVR_CRF       /*!< Controller-role request flag     */
#define HAL_I3C_FLAG_CRUPDF     LL_I3C_EVR_CRUPDF    /*!< Controller-role update flag      */
#define HAL_I3C_FLAG_HJF        LL_I3C_EVR_HJF       /*!< Hot-join flag                    */
#define HAL_I3C_FLAG_WKPF       LL_I3C_EVR_WKPF      /*!< Wakeup flag                      */
#define HAL_I3C_FLAG_GETF       LL_I3C_EVR_GETF      /*!< GETxxx CCC flag                  */
#define HAL_I3C_FLAG_STAF       LL_I3C_EVR_STAF      /*!< Format 1 GETSTATUS CCC flag      */
#define HAL_I3C_FLAG_DAUPDF     LL_I3C_EVR_DAUPDF    /*!< ENTDAA/RSTDAA/SETNEWDA CCC flag  */
#define HAL_I3C_FLAG_MWLUPDF    LL_I3C_EVR_MWLUPDF   /*!< SETMWL CCC flag                  */
#define HAL_I3C_FLAG_MRLUPDF    LL_I3C_EVR_MRLUPDF   /*!< SETMRL CCC flag                  */
#define HAL_I3C_FLAG_RSTF       LL_I3C_EVR_RSTF      /*!< Reset pattern flag               */
#define HAL_I3C_FLAG_ASUPDF     LL_I3C_EVR_ASUPDF    /*!< ENTASx CCC flag                  */
#define HAL_I3C_FLAG_INTUPDF    LL_I3C_EVR_INTUPDF   /*!< ENEC/DISEC CCC flag              */
#define HAL_I3C_FLAG_DEFF       LL_I3C_EVR_DEFF      /*!< DEFTGTS CCC flag                 */
#define HAL_I3C_FLAG_GRPF       LL_I3C_EVR_GRPF      /*!< DEFGRPA CCC flag                 */
/**
  * @}
  */

/** @defgroup I3C_COMMON_INTERRUPT_MASKS I3C COMMON INTERRUPT MASKS
  * @{
  */
#define HAL_I3C_IT_MASKS_TXFNFMIS      LL_I3C_MISR_TXFNFMIS /*!< Tx FIFO not full interrupt mask      */
#define HAL_I3C_IT_MASKS_RXFNEMIS      LL_I3C_MISR_RXFNEMIS /*!< Rx FIFO not empty interrupt mask     */
#define HAL_I3C_IT_MASKS_FCMIS         LL_I3C_MISR_FCMIS    /*!< Frame complete interrupt mask        */
#define HAL_I3C_IT_MASKS_ERRMIS        LL_I3C_MISR_ERRMIS   /*!< Error interrupt mask                 */
#define HAL_I3C_ALL_COMMON_ITS_MASK    (uint32_t)(LL_I3C_MISR_TXFNFMIS | LL_I3C_MISR_RXFNEMIS | \
                                                  LL_I3C_MISR_FCMIS    | LL_I3C_MISR_ERRMIS)
/**
  * @}
  */

/** @defgroup I3C_TARGET_INTERRUPT_MASKS I3C TARGET INTERRUPT MASKS
  * @{
  */
#define HAL_I3C_IT_MASKS_IBIENDMIS     LL_I3C_MISR_IBIENDMIS /*!< IBI end interrupt mask                    */
#define HAL_I3C_IT_MASKS_CRUPDMIS      LL_I3C_MISR_CRUPDMIS  /*!< controller-role update interrupt mask     */
#define HAL_I3C_IT_MASKS_WKPMIS        LL_I3C_MISR_WKPMIS    /*!< wakeup interrupt mask                     */
#define HAL_I3C_IT_MASKS_GETMIS        LL_I3C_MISR_GETMIS    /*!< GETxxx CCC interrupt mask                 */
#define HAL_I3C_IT_MASKS_STAMIS        LL_I3C_MISR_STAMIS    /*!< GETSTATUS CCC interrupt mask              */
#define HAL_I3C_IT_MASKS_DAUPDMIS      LL_I3C_MISR_DAUPDMIS  /*!< ENTDAA/RSTDAA/SETNEWDA CCC interrupt mask */
#define HAL_I3C_IT_MASKS_MWLUPDMIS     LL_I3C_MISR_MWLUPDMIS /*!< SETMWL CCC interrupt mask                 */
#define HAL_I3C_IT_MASKS_MRLUPDMIS     LL_I3C_MISR_MRLUPDMIS /*!< SETMRL CCC interrupt mask                 */
#define HAL_I3C_IT_MASKS_RSTMIS        LL_I3C_MISR_RSTMIS    /*!< reset pattern interrupt mask              */
#define HAL_I3C_IT_MASKS_ASUPDMIS      LL_I3C_MISR_ASUPDMIS  /*!< ENTASx CCC interrupt mask                 */
#define HAL_I3C_IT_MASKS_INTUPDMIS     LL_I3C_MISR_INTUPDMIS /*!< ENEC/DISEC CCC interrupt mask             */
#define HAL_I3C_IT_MASKS_DEFMIS        LL_I3C_MISR_DEFMIS    /*!< DEFTGTS CCC interrupt mask                */
#define HAL_I3C_IT_GRPMIS              LL_I3C_MISR_GRPMIS    /*!< DEFGRPA CCC interrupt mask                */
#define HAL_I3C_ALL_TGT_ITS_MASK     (uint32_t)(LL_I3C_MISR_IBIENDMIS | LL_I3C_MISR_CRUPDMIS  | LL_I3C_MISR_WKPMIS   | \
                                                LL_I3C_MISR_GETMIS    | LL_I3C_MISR_STAMIS    | LL_I3C_MISR_DAUPDMIS | \
                                                LL_I3C_MISR_MWLUPDMIS | LL_I3C_MISR_MRLUPDMIS | LL_I3C_MISR_RSTMIS   | \
                                                LL_I3C_MISR_ASUPDMIS  | LL_I3C_MISR_INTUPDMIS | LL_I3C_MISR_DEFMIS   | \
                                                LL_I3C_MISR_GRPMIS)
/**
  * @}
  */

/** @defgroup I3C_CONTROLLER_INTERRUPT I3C CONTROLLER INTERRUPT
  * @{
  */
#define HAL_I3C_IT_CFNFMIS              LL_I3C_MISR_CFNFMIS     /*!< Control FIFO not full interrupt mask     */
#define HAL_I3C_IT_SFNEMIS              LL_I3C_MISR_SFNEMIS     /*!< Status FIFO not empty interrupt mask     */
#define HAL_I3C_IT_HJMIS                LL_I3C_MISR_HJMIS       /*!< Hot-join interrupt mask                  */
#define HAL_I3C_IT_CRMIS                LL_I3C_MISR_CRMIS       /*!< Controller-role request interrupt mask   */
#define HAL_I3C_IT_IBIMIS               LL_I3C_MISR_IBIMIS      /*!< IBI request interrupt mask               */
#define HAL_I3C_IT_RXTGTENDMIS          LL_I3C_MISR_RXTGTENDMIS /*!< Target-initiated read end interrupt mask */
#define HAL_I3C_ALL_CTRL_ITS_MASK       (uint32_t)(LL_I3C_MISR_CFNFMIS | LL_I3C_MISR_SFNEMIS | LL_I3C_MISR_HJMIS | \
                                                   LL_I3C_MISR_CRMIS   | LL_I3C_MISR_IBIMIS  | LL_I3C_MISR_RXTGTENDMIS)
/**
  * @}
  */

