stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_i3c.h
/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Constants I3C Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Macro I3C Private Macros
  * @{
  */
#define IS_I3C_MODE(__MODE__) (((__MODE__) == HAL_I3C_MODE_NONE)       || \
                               ((__MODE__) == HAL_I3C_MODE_CONTROLLER) || \
                               ((__MODE__) == HAL_I3C_MODE_TARGET))

#define IS_I3C_INTERRUPTMASK(__MODE__, __ITMASK__) (((__MODE__) == HAL_I3C_MODE_CONTROLLER)             ? \
                                                    ((((__ITMASK__) & HAL_I3C_ALL_CTRL_ITS) != 0x0U)   || \
                                                     (((__ITMASK__) & HAL_I3C_ALL_COMMON_ITS) != 0x0U)) : \
                                                    ((((__ITMASK__) & HAL_I3C_ALL_TGT_ITS) != 0x0U)    || \
                                                     (((__ITMASK__) & HAL_I3C_ALL_COMMON_ITS) != 0x0U)))

#define IS_I3C_ENTDAA_OPTION(__OPTION__) (((__OPTION__) == I3C_RSTDAA_THEN_ENTDAA) || \
                                          ((__OPTION__) == I3C_ONLY_ENTDAA))

#define IS_I3C_SDAHOLDTIME_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_SDA_HOLD_TIME_0_5) || \
                                             ((__VALUE__) == HAL_I3C_SDA_HOLD_TIME_1_5) || \
                                             ((__VALUE__) == HAL_I3C_SDA_HOLD_TIME_2_5) || \
                                             ((__VALUE__) == HAL_I3C_SDA_HOLD_TIME_3_5))

#define IS_I3C_WAITTIME_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_OWN_ACTIVITY_STATE_0) || \
                                          ((__VALUE__) == HAL_I3C_OWN_ACTIVITY_STATE_1) || \
                                          ((__VALUE__) == HAL_I3C_OWN_ACTIVITY_STATE_2) || \
                                          ((__VALUE__) == HAL_I3C_OWN_ACTIVITY_STATE_3))

#define IS_I3C_TXFIFOTHRESHOLD_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_TXFIFO_THRESHOLD_1_4) || \
                                                 ((__VALUE__) == HAL_I3C_TXFIFO_THRESHOLD_4_4))

#define IS_I3C_RXFIFOTHRESHOLD_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_RXFIFO_THRESHOLD_1_4) || \
                                                 ((__VALUE__) == HAL_I3C_RXFIFO_THRESHOLD_4_4))

#define IS_I3C_CONTROLFIFOSTATE_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_CONTROLFIFO_DISABLE) || \
                                                  ((__VALUE__) == HAL_I3C_CONTROLFIFO_ENABLE))

#define IS_I3C_STATUSFIFOSTATE_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_STATUSFIFO_DISABLE) || \
                                                 ((__VALUE__) == HAL_I3C_STATUSFIFO_ENABLE))

#define IS_I3C_DEVICE_VALUE(__VALUE__) (((__VALUE__) >= 1U) && ((__VALUE__) <= 4U))

#define IS_I3C_DYNAMICADDRESS_VALUE(__VALUE__) ((__VALUE__) <= 0x7FU)

#define IS_I3C_FUNCTIONALSTATE_VALUE(__VALUE__) (((__VALUE__) == DISABLE) || \
                                                 ((__VALUE__) == ENABLE))

#define IS_I3C_HANDOFFACTIVITYSTATE_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_HANDOFF_ACTIVITY_STATE_0) || \
                                                      ((__VALUE__) == HAL_I3C_HANDOFF_ACTIVITY_STATE_1) || \
                                                      ((__VALUE__) == HAL_I3C_HANDOFF_ACTIVITY_STATE_2) || \
                                                      ((__VALUE__) == HAL_I3C_HANDOFF_ACTIVITY_STATE_3))

#define IS_I3C_TSCOTIME_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS) || \
                                          ((__VALUE__) == HAL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS))

#define IS_I3C_MAXSPEEDDATA_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_GETMXDS_FORMAT_1    ) || \
                                              ((__VALUE__) == HAL_I3C_GETMXDS_FORMAT_2_LSB) || \
                                              ((__VALUE__) == HAL_I3C_GETMXDS_FORMAT_2_MID) || \
                                              ((__VALUE__) == HAL_I3C_GETMXDS_FORMAT_2_MSB))

#define IS_I3C_IBIPAYLOADSIZE_VALUE(__VALUE__) (((__VALUE__) == HAL_I3C_PAYLOAD_EMPTY  ) || \
                                                ((__VALUE__) == HAL_I3C_PAYLOAD_1_BYTE ) || \
                                                ((__VALUE__) == HAL_I3C_PAYLOAD_2_BYTES) || \
                                                ((__VALUE__) == HAL_I3C_PAYLOAD_3_BYTES) || \
                                                ((__VALUE__) == HAL_I3C_PAYLOAD_4_BYTES))

#define IS_I3C_MIPIIDENTIFIER_VALUE(__VALUE__) ((__VALUE__) <= 0x0FU)

#define IS_I3C_MAXREADTURNARROUND_VALUE(__VALUE__) ((__VALUE__) <= 0xFFU)

#define I3C_CHECK_IT_SOURCE(__IER__, __IT__)  ((((__IER__) & (__IT__)) == (__IT__)) ? SET : RESET)

#define I3C_CHECK_FLAG(__ISR__, __FLAG__) ((((__ISR__) & (__FLAG__)) == (__FLAG__)) ? SET : RESET)

#define IS_I3C_DMASOURCEBYTE_VALUE(__VALUE__) ((__VALUE__) == DMA_SRC_DATAWIDTH_BYTE)

#define IS_I3C_DMASOURCEWORD_VALUE(__VALUE__) ((__VALUE__) == DMA_SRC_DATAWIDTH_WORD)

#define IS_I3C_DMADESTINATIONBYTE_VALUE(__VALUE__) ((__VALUE__) == DMA_DEST_DATAWIDTH_BYTE)

#define IS_I3C_DMADESTINATIONWORD_VALUE(__VALUE__) ((__VALUE__) == DMA_DEST_DATAWIDTH_WORD)

#define I3C_GET_DMA_REMAIN_DATA(__HANDLE__) (__HAL_DMA_GET_COUNTER(__HANDLE__) + HAL_DMAEx_GetFifoLevel(__HANDLE__))

#define IS_I3C_TRIG_SOURCE(__INSTANCE__, __SOURCE__)  (IS_I3C_GRP1_TRIG_SOURCE(__SOURCE__))

#define IS_I3C_GRP1_TRIG_SOURCE(__SOURCE__)  (((__SOURCE__) == I3C_GRP1_GPDMA_CH0_TCF_TRG    ) || \
                                              ((__SOURCE__) == I3C_GRP1_GPDMA_CH1_TCF_TRG    ) || \
                                              ((__SOURCE__) == I3C_GRP1_GPDMA_CH2_TCF_TRG    ) || \
                                              ((__SOURCE__) == I3C_GRP1_GPDMA_CH3_TCF_TRG    ) || \
                                              ((__SOURCE__) == I3C_GRP1_EXTI5_TRG            ) || \
                                              ((__SOURCE__) == I3C_GRP1_EXTI9_TRG            ) || \
                                              ((__SOURCE__) == I3C_GRP1_LPTIM1_CH1_TRG       ) || \
                                              ((__SOURCE__) == I3C_GRP1_LPTIM2_CH1_TRG       ) || \
                                              ((__SOURCE__) == I3C_GRP1_COMP1_TRG            ) || \
                                              ((__SOURCE__) == I3C_GRP1_COMP2_TRG            ) || \
                                              ((__SOURCE__) == I3C_GRP1_RTC_ALRA_TRG         ) || \
                                              ((__SOURCE__) == I3C_GRP1_RTC_WUT_TRG          ) || \
                                              ((__SOURCE__) == I3C_GRP1_TIM15_TGO_CKTIM_TRG  ) || \
                                              ((__SOURCE__) == I3C_GRP1_TIM16_OC1_TRG        ))

#define IS_I3C_TRIG_INPUT_INSTANCE(__INSTANCE__)    (IS_I3C_GRP1_INSTANCE(__INSTANCE__))

#define IS_I3C_AUTO_MODE_TRG_POL(__POLARITY__)      (((__POLARITY__) == I3C_TRIG_POLARITY_LOW) || \
                                                     ((__POLARITY__) == I3C_TRIG_POLARITY_HIGH))

#define IS_I3C_END_OF_FRAME_MODE(__VALUE__)    (((__VALUE__) == I3C_END_OF_FRAME_CPLT_ENABLE) || \
                                                ((__VALUE__) == I3C_END_OF_FRAME_CPLT_DISABLE))
#define IS_I3C_PATTERN(__PATTERN__) (((__PATTERN__) == HAL_I3C_TARGET_RESET_PATTERN) || \
                                     ((__PATTERN__) == HAL_I3C_HDR_EXIT_PATTERN))

#define IS_I3C_RESET_PATTERN(__RSTPTRN__) (((__RSTPTRN__) == HAL_I3C_RESET_PATTERN_ENABLE)   || \
                                           ((__RSTPTRN__) == HAL_I3C_RESET_PATTERN_DISABLE))
/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Functions I3C Private Functions
  * @{
  */
/* Private functions are defined in stm32u3xx_hal_i3c.c file */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U3xx_HAL_I3C_H */
